from bing_image_downloader import downloader
import os

''' bing_imgage_downloader

query_string: String to be searched.
limit: (optional, default is 100) Number of images to download.  - 사진 개수
output_dir: (optional, default is 'dataset') Name of output dir. - 폴더 경로
adult_filter_off: (optional, default is True) Enable of disable adult filteration. - 성인 필터 여부
force_replace: (optional, default is False) Delete folder if present and start a fresh download. - 기존 사진 삭제 여부
timeout: (optional, default is 60) timeout for connection in seconds.
verbose: (optional, default is True) Enable downloaded message.  다운로드 메시지

'''

men = ['감우성', '강경준', '강계식', '강기영', '강남길', '강동원', '강민혁', '강봉성', '강석우', '강성민', '강성진', '강성필', '강성훈', '강승원', '강신일', '강유석', '강은탁', '강이석', '강인덕', '강정우', '강지섭', '강태오', '강하늘', '강훈', '고경표', '고세원', '고수', '고우림', '고윤', '고인범', '고주원', '고창석', '공명', '공유', '공정환', '공형진', '구교환', '곽도원', '곽동연', '곽민석', '곽시양', '곽정욱', '곽희성', '구자성', '권동호', '권상우', '권오중', '권율', '권태원', '권해성', 
       '권해효', '권혁수', '권현상', '권화운', '기도훈', '기세중', '기주봉', '기태영', '길용우', '길정우', '김갑수', '김강우', '김강훈', '김건우', '김경남', '김광규', '김광영', '김권', '김규철', '김기남', '김기두', '김기방', '김기섭', '김기천', '김기해', '김기현', '김남길', '김남희', '김다현', '김단율', '김대명', '김덕현', '김도완', '김도윤', '김도현', '김도훈', '김동빈', '김동완', '김동욱', '김동윤', '김동희  1978년생', '김동희  1999년생', '김래원', '김뢰하', '김명곤', '김명민', 
       '김명수  1966년생', '김명수 인피니트', '김명준', '김무생', '김무열', '김민교', '김민규  1994년생', '김민규  2001년생', '김민기', '김민상', '김민석', '김민수', '김민식', '김민재  1979년생', '김민재  1996년생', '김민종', '김민준', '김범', '김법래', '김병기', '김병세', '김병옥', '김산호', '김상경', '김상중', '김상호', '김서하', '김석훈', '김선웅', '김선혁', '김선호', '김성겸  1941년생', '김성겸  1982년생', '김성규', '김성균', '김성민  1973년생', '김성민  1980년생', 
       '김성민  1991년생', '김성수', '김성오', '김성철', '김수로', '김수현', '김순철', '김승수', '김승우', '김승욱', '김시후', '김영광', '김영기', '김영대', '김영민', '김영배', '김영석', '김영재', '김영준', '김영철', '김영호', '김영훈', '김예준', '김용건', '김용희', '김우빈', '김유석', '김윤석', '김응수', '김의성', '김이안', '김인권', '김일우', '김재영', '김재욱', '김재원  1981년생', '김재원  2001년생', '김재중 JYJ', '김정균', '김정민', '김정욱', '김정운', '김정태', '김정학', '김정현  1976년생', 
       '김정현  1990년생', '김정훈', '김종구', '김종훈', '김주영', '김주혁', '김준  1984년생', '김준  2014년생', '김준한', '김지석', '김지훈', '김진규', '김진수', '김진우', '김진엽', '김찬우', '김창봉', '김창완', '김태우', '김태형 BTS', '김태훈', '김혁', '김혁', '김현목', '김현빈', '김현중 SS501', '김현진', '김형묵', '김형민', '김형범', '김형준 SS501', '김혜성', '김호진', '김홍파', '김홍표', '김흥수', '김희라', '김희원','나인우', '나윤찬', '남경읍', '남궁민', '남궁원', '남다름', '남성진', 
       '남주혁', '노민우', '노상현', '노영학', '노이한', '노종현', '노주현', '노태엽', '노형욱', '도경수', '도상우', '도지한', '독고영재', '동현배', '려운', '로몬', '류경수', '류담', '류덕환', '류성록', '류수영', '류승룡', '류승범', '류승수', '류준열', '류진', '류태준', '마동석', '맹상훈', '맹세창', '명계남', '명로진', '무진성', '문상민', '문성근', '문오장', '문우진', '문정혁 신화', '문창길', '문천식', '문태유', '민지환', '문지후','박강현', '박건우', '박건형', '박광현', '박근형', '박기웅', 
       '박남현', '박노식', '박동빈', '박민수', '박민우', '박병훈', '박보검', '박신우', '박상면', '박상민', '박상원', '박상조', '박서준', '박서함', '박성웅', '박성훈', '박수영', '박시진', '박시후', '박신양', '박신우', '박영규', '박용우', '박원상', '박윤재', '박은석', '박인환', '박재정', '박정민', '박정우  1968년생', '박정우  1996년생', '박정철', '박정표', '박정학', '박종관', '박종찬', '박종혁', '박주형', '박준규', '박준목', '박중훈', '박지빈', '박지일', '박지훈', '박진우  1973년생', '박진우  1983년생', '박찬환', 
       '박천', '박철민', '박철호', '박칠용', '박해수', '박해일', '박해진', '박해준', '박혁권', '박형식', '박형준', '박훈', '박희순', '방형주', '배성우', '배유람', '배인혁', '백도빈', '백서빈', '백성현', '백윤식', '백일섭', '백종민', '백현 EXO', '백형훈', '변요한', '변우민', '변우석', '변희봉', '봉태규','서강준', '서건우', '서경수', '서도영', '서배준', '서우진', '서영주', '서인국', '서인석', '서준', '서준영', '서지석', '서지훈', '서태화', '서하준', '서현철', '선동혁', '선우재덕', '설경구', '설정환', '서동원', '성동일', 
       '성민준', '성준', '성지루', '성혁', '성훈', '소지섭', '손병호', '손상연', '손석구', '손종학', '손우현', '손유동', '손창민', '손현주', '손호균', '손호준', '송강', '송강호', '송건희', '송경철', '송기윤', '송민재', '송새벽', '송승헌', '송승환', '송영규', '송영창', '송원근', '송원석', '송일국', '송재림', '송재호', '송재희', '송종호', '송중기', '송창의', '신구', '신귀식', '신담수', '신동욱', '신성록', '신성우', '신성일', '신승환', '신영균', '신이안', '신재하', '신정근', '신하균', '신현준', '심양홍', '심우창', '심지호', '심형탁', 
       '심희섭','안내상', '안도규', '안병경', '안보현', '안상태', '안석환', '안성기', '안세하', '안신원', '안우연', '안은호', '안재모', '안재욱', '안재현', '안재환', '안재영', '안재홍', '안형준', '안효섭', '양동근', '양동재', '양대혁', '양병열', '양승리', '양세종', '양영조', '양택조', '양현민', '엄기준', '엄태구', '엄태웅', '여욱환', '여진구', '여현수', '연규진', '연우진', '연정훈', '연제욱', '연준석', '염동헌', '예학영', '오경수', '오광록', '오달수', '오대규', '오대환', '오만석', '오민석', '오상훈', '오승윤', '오영수', '오의식', 
       '오재무', '오정세', '오지명', '오지호', '오창석', '오태경', '오한결', '오현경  1936년생', '옥택연', '온주완', '옹성우', '왕룡', '우도환', '우봉식', '우현', '원기준', '원빈', '원우준', '위하준', '유노윤호', '유동근', '유대준', '유민규', '유병준', '유수빈', '유순철', '유승호', '유아인', '유연석', '유오성', '유인촌', '유재명', '유주원', '유준상', '유준서', '유준후', '유지태', '유태웅', '유퉁', '유해진', '육동일', '육성재', '윤계상', '윤균상', '윤기원', '윤다훈', '윤동환', '윤두준', '윤봉길', '윤문식', '윤박', '윤상현', '윤선우', 
       '윤세웅', '윤세현', '윤소호', '윤승원', '윤시윤', '윤영준', '윤용현', '윤제문', '윤종훈', '윤주만', '윤주빈', '윤주상', '윤지현', '윤지오', '윤찬영', '윤철형', '윤태영', '윤현민', '윤현수', '윤홍빈', '윤희석', '위하준', '음문석', '이경영  1958년생', '이경영  1960년생', '이경훈', '이계영', '이계인', '이광기', '이광수', '이규복', '이규성', '이규한', '이규형', '이기광', '이기영', '이기우', '이낙훈', '이다윗', '이대근', '이대로', '이대엽', '이덕화', '이도경', '이도련', '이도현', '이동건', '이동규', '이동욱', '이동준', '이동휘', 
       '이로운', '이명호', '이명훈', '이묵원', '이문식', '이민기', '이민우', '이민호', '이범수', '이병욱', '이병준', '이병헌', '이상엽', '이상우', '이상윤', '이상이', '이상인', '이서진', '이석준', '이선균', '이성민', '이성열 인피니트', '이성웅', '이성재', '이세창', '이수완', '이수혁', '이순재', '이승기', '이승호 1947년생', '이승효', '이승우', '이승원', '이승준', '이승현', '이승형', '이시강', '이시언', '이신영', '이신재', '이영범', '이영후', '이영훈', '이예춘', '이완', '이용규', '이용주', '이윤상', '이원근', '이원종  1944년생', 
       '이원종  1966년생', '이유진', '이은형', '이이경', '이인성', '이일민', '이일웅', '이일재', '이장우', '이재균', '이재룡', '이재용', '이재우', '이재욱', '이재원', '이재윤', '이재준', '이재포', '이재황', '이정길', '이정길  1984년생', '이정섭', '이정신', '이정용', '이정재', '이정진', '이정헌', '이정현  1990년생', '이제훈', '이종구', '이종석', '이종수', '이종원', '이종혁', '이종현', '이주승', '이주안', '이주원', '이주현', '이준', '이준기', '이준영', '이준혁', '이준혁  1972년생', '이중옥', '이지훈', '이지훈  1979년생', '이지훈  1988년생', 
       '이진수', '이진우', '이진욱', '이찬', '이찬호  1989년생', '이찬호  1994년생', '이창용', '이창욱', '이창환', '이창훈', '이천희', '이철민', '이춘식', '이충주', '이태곤', '이태구', '이태리', '이태성', '이태선', '이태환', '이필모', '이학주', '이한위', '이해우', '이혁재', '이현우', '이현진', '이형철', '이호원', '이호재', '이호철', '이효정', '이효제', '이훈', '이희도', '이희준', '인교진', '임강성', '임대호', '임동진', '임별', '임상준', '임선택', '임성민', '임슬옹', '임시완', '임영규', '임원희', '임주환', '임지규', '임창정', '임채무', '임하룡', 
       '임혁', '임현식', '임형준', '임호','장광', '장근석', '장기범', '장기용', '장동건', '장동윤', '장률', '장민수', '장성원', '장세진', '장승조', '장용', '장원영', '장태성', '장항선', '장혁', '장현성', '재희', '전광렬', '전국환', '전노민', '전무송', '전배수', '전성우', '전운', '전인택', '전지환', '전진기', '전진서', '전태수', '정겨운', '정건주', '정경호  1972년생', '정경호  1983년생', '정기섭', '정동근', '정동남', '정동화', '정동환', '정링컨', '정만식', '정명준', '정명환', '정민', '정민성', '정보석', '정상훈', '정석용', '정석원', '정성모', '정성영', 
       '정성화', '정승호', '정용화', '정우', '정우성', '정우식', '정우혁', '정욱  1938년생', '정욱  1973년생', '정욱진', '정운택', '정원중', '정웅인', '정은찬', '정은우', '정은표', '정인기', '정일우', '정재영', '정재용', '정제원', '정종준', '정준하', '정준호', '정지환', '정지훈', '정지훈  2007년생', '정진', '정진영', '정진운', '정진화', '정준원', '정찬', '정태우', '정택현', '정한용', '정한헌', '정해인', '정현준', '정호근', '정호빈', '정휘', '조경환', '조권', '조달환', '조덕현', '조동혁', '조복래', '조병규', '조상구', '조상기', '조성하', 
       '조승우', '조원희', '조윤우', '조연우', '조인성', '조재완', '조재윤', '조정석', '조지환', '조진웅', '조춘', '조태관', '조한선', '조한준', '조현재', '조희봉', '주민준', '주원', '주종혁  1983년생', '주종혁  1991년생', '주지훈', '주진모  1958년생', '주진모  1974년생', '주현', '주호성', '준호', '지대한  1969년생', '지대한  2001년생', '지윤호', '지일주', '지성', '지세현', '지수', '지진희', '지창욱', '지현우', '진영', '진태현','차광수', '차기환', '차도진', '차승원', '차인표', '차태현', '차학연', '차선우', '채상우', '채종협', '천호진', '최강창민', 
       '최광일', '최권수', '최규환', '최다니엘', '최대철', '최덕문', '최동균', '최동준', '최로운', '최명수', '최무룡', '최무성', '최민  1974년생', '최민수', '최민식', '최민용', '최민호 샤이니', '최병학', '최불암', '최상  1987년생', '최상훈', '최성국', '최성원', '최성재', '최성준', '최수종', '최승훈', '최시원', '최영준', '최오식', '최우식', '최우성', '최운교', '최원영', '최원홍', '최은석', '최일화', '최윤제', '최재림', '최재섭', '최재성', '최재원', '최재호', '최재환', '최정우', '최정원  1981년생', '최제우', '최종원', '최종윤', '최종환', '최주봉', '최준용', 
       '최지호', '최진영', '최진혁', '최철호', '최태준', '최필립', '최한', '최현욱', '최현호', '탁트인', '탕준상', '태민영', '태인호', '태항호', '판유걸','하대경', '하도권', '하명중', '하석진', '하정우', '한갑수', '한상진', '한석규', '한세진', '한영수', '한인수', '한은성', '한재석', '한주완', '한준우', '한지상', '한진희', '한춘일', '한태일', '허기호', '허성태', '허영생', '허장강', '허정민', '허준호', '허태희', '현봉식', '현빈', '현석', '현우', '현우성', '홍경인', '홍광호', '홍기훈', '홍동영', '홍석천', '홍성민', '홍성우', '홍성헌', '홍순창', '홍시영', '홍요섭', 
       '홍일권', '홍종현', '홍태의', '홍학표', '황동주', '황범식', '황성웅', '황인성', '황정리', '황정민', '황찬성', '황해']

women = ['가득희', '갈소원', '강경헌', '강나언', '강다현', '강두리', '강리나', '강림', '강문영', '강민경', '강민아', '강별', '강부자', '강성아', '강성연', '강소라', '강소연', '강수빈', '강수연', '강수진', '강예빈', '강예서', '강예솔', '강예원', '강은비', '강은아', '강지영', '강한나', '강혜정', '견미리', '경수진', '경인선', '고나은', '고나희', '고두심', '고민시', '고보결', '고성희', '고소영', '고아라', '고아성', '고원희', '고윤정', '고은미', '고은아 1946년생', '고은아 1988년생', '고준희', '고현정', '공성하', '공승연', '공효진', '곽지민', '곽진영', '구재이', 
         '구하진', '구혜선', '권다현', '권세은', '권소현', '권아름', '권유나', '권유리', '권은수', '권은아', '권정은', '금단비', '금보라', '금새록', '기은세', '길해연', '김가란', '김가빈', '김가연', '김가은 1989년 1월생', '김가은 1989년 5월생', '김가희', '김고은', '김국희', '김규남', '김규리 1979년생', '김규리 2008년생', '김규선', '김꽃비', '김나운', '김남주', '김남주', '김다미', '김다솜', '김다솜', '김다연', '김단우', '김도연', '김동주', '김려은', '김리', '김미경', '김미수', '김민', '김민경', '김민서', '김민아', '김민정 1948년생', '김민정 1982년생', 
         '김민주 1979년생', '김민주 2001년생', '김민채', '김민희 1972년생', '김민희 1976년생', '김민희 1982년생', '김보경 1976년생', '김보경 1982년생', '김보라', '김보미 1958년생', '김보미 1984년생', '김보미 1987년생', '김보민', '김보연', '김부선', '김빈', '김빈우', '김빛나리', '김사랑', '김새론', '김새벽', '김서라', '김서연', '김서형', '김선아 1973년생', '김선아 1994년생', '김선영', '김선화', '김설', '김성경 1977년생', '김성경 2003년생', '김성령', '김성은 1983년생', '김성은 1991년생', '김세정', '김소라', '김소연', '김소영', 
         '김소원', '김소은', '김소현 1975년생', '김소현 1999년생', '김소혜', '김솔비', '김수미', '김수안', '김수인', '김수연', '김수정', '김수진 1974년생', '김수진 1975년생', '김수현', '김슬기', '김시아', '김신영', '김신재', '김아영', '김아중', '김애경', '김애란', '김여진 1972년생', '김여진 1987년생', '김영란', '김영애', '김영옥', '김예령', '김예원', '김옥빈', '김용림', '김용선', '김용지', '김원희', '김유리 1977년생', '김유리 1984년생', '김유리 2000년생', '김유리 1990년생', '김유미 1979년생', '김유빈', '김유정', '김윤경 1949년생', 
         '김윤경 1976년생', '김윤서', '김윤지', '김윤진', '김은혜', '김을동', '김을분', '김의선', '김이경', '김이영', '김이지', '김인이', '김자옥', '김재인', '김재화', '김정난', '김정연', '김정은', '김정화', '김정훈', '김주령', '김주영', '김지미', '김지민', '김지성', '김지수', '김지연', '김지영 1938년생', '김지영 1974년생', '김지영 2005년생', '김지우', '김지원', '김지은 1988년생', '김지은 1991년생', '김지은 1993년생', '김지현', '김지호', '김진아', '김진이', '김창숙', '김청', '김태리', '김태린 1997년 8월생', '김태린 1997년 12월생', 
         '김태희', '김하경', '김하늘', '김하영', '김향기', '김해숙', '김해인', '김현수', '김현숙', '김현주', '김형자', '김혜리', '김혜수', '김혜옥', '김혜윤', '김혜은', '김혜자', '김혜주', '김혜지', '김혜진', '김환희', '김효선', '김효은', '김효주', '김효진', '김희선', '김희애', '김희정 1970년', '김희정 1992년','나문희', '나영희', '나하나', '나해령', '나혜미', '남규리', '남능미', '남보라', '남상미', '남상지', '남윤정', '남정임', '남지현', '노수산나', '노윤서', '노정의', '노현희', '도연진', '도은비', '도지원', '라미란', '랑연', '류아벨', '류원', '류이재', 
         '류인아', '류한비', '류현경', '류혜영', '류화영', '명세빈', '문가영', '문근영', '문보령', '문수빈', '문숙', '문예원', '문정숙', '문정희', '문주연', '문지인', '문채원', '문희경', '민도희', '민서우', '민영원', '민예지', '민유리', '민지아', '민지영', '민채은', '민효린','박가람', '박경혜', '박규리', '박규영', '박길라', '박명신', '박민영', '박민지', '박민하  1991년생', '박민하  2007년생', '박보영', '박서영', '박서현', '박선아', '박선영  1970년생', '박선영  1976년생', '박세영', '박세영  Charmy', '박세완', '박세진  1996년생', '박세진  1999년생', '박소담', 
         '박소은', '박소이', '박소현', '박솔미', '박수영', '박순천', '박시연', '박시은', '박신아', '박신혜', '박아인', '박연수  1979년생', '박연수  1990년생', '박연아', '박영린', '박예린', '박예진  1981년생', '박예진  2000년생', '박원숙', '박유나', '박은빈', '박은우', '박은혜', '박정수', '박정아', '박정원', '박정윤', '박정인', '박정자', '박정화', '박주미', '박주원', '박주현', '박준금', '박지수', '박지연', '박지영', '박지예', '박지원', '박지후', '박지윤', '박지현', '박진주', '박진희', '박초롱', '박탐희', '박하나', '박하선', '박한별', '박한솔', '박해미', '박해원', 
         '박현숙', '박현우', '박혜수', '박효주', '박환희', '박희본', '박희진', '반소영', '반효정', '방민아', '방은정', '방은희', '배그린', '배누리', '배다빈', '배두나', '배선희', '배수지', '배슬기', '배윤경', '배정아', '배정화', '배종옥', '배주현', '백수련', '백수민', '백승희', '백옥담', '백지원', '백지혜', '백진희', '변서윤', '변정수', '복혜숙', '빙혜진','사미자', '서갑숙', '서경화', '서권순', '서미지', '서민정', '서민지', '서수민', '서수희', '서신애', '서영', '서영화', '서영희', '서예리', '서예지', '서예화', '서우', '서우림', '서유리', '서유정', '서은수', '서은우', '서은하', 
         '서이라', '서이수', '서이숙', '서이안', '서정연', '서주현', '서지혜', '서지희', '서하', '서현진', '서혜린', '서효림', '선연수', '선우서하', '선우선', '선우용여', '선우은숙', '설리', '설현', '설수진', '설수현', '설유안', '설인아', '성유나', '성유리', '성은', '성은우', '성현아', '소아린', '소유진', '소이', '소이현', '소정화', '손나은', '손담비', '손성윤', '손숙', '손여은', '손예진', '손유경', '손은서', '손정림', '손지나', '손지현', '손태영', '송다은', '송선미', '송승하', '송연', '송영하', '송예빈', '송옥숙', '송유정', '송윤아', '송은영', '송지오', '송지우', '송지현', '송지효', 
         '송채윤', '송채환', '송하윤', '송혜교', '송혜원', '수애', '시은', '신가은', '신다은', '신도현', '신동미', '신민아', '신세경', '신소미', '신소율', '신소현', '신시아', '신신애', '신애라', '신은경', '신은수', '신은정', '신이', '신주아', '신지수', '신지연', '신현빈', '신혜선', '심은경', '심은우', '심은진', '심은하', '심이영', '심혜진','안문숙', '안서현', '안선영', '안소영', '안소희', '안연홍', '안은진', '안주미', '안혜경', '양미경', '양새롬', '양서현', '양정아', '양진성', '양혜지', '양희경', '엄앵란', '엄유신', '엄정화', '엄지원', '엄현경', '여민정', '여운계', '연민지', '염정아', 
         '예수정', '예지원', '오나라', '오미연', '오미희', '오산하', '오세정', '오소현', '오수미', '오수연', '오승은', '오승현', '오아린', '오아연', '오연서', '오연수', '오연아', '오영실', '오유나', '오윤아', '오인혜', '오지은', '오초희', '오하늬', '오하영', '오현경  1970년생', '오혜원', "옥고운", '옥자연', '옥주현', '왕빛나', '왕지혜', '우다비', '우희진', '원미경', '원진아', '유다인', '유미호', '유서진', '유선', '유세례', '유연미', '유연지', '유인나', '유인영', '유지인', '유진', '유하나', '유혜리', '유혜인', '유혜정', '유호린', '유호정', '윤가이', 
         '윤다영', '윤미라', '윤미향', '윤보라', '윤보미', '윤사라', '윤상정', '윤소이', '윤소희', '윤수', '윤슬  1990년생', '윤슬  1992년생', '윤슬기', '윤승아', '윤아름', '윤아정', '윤여정', '윤영민', '윤예주', '윤예희', '윤유선', '윤은혜', '윤정희  1944년생', '윤정희  1980년생', '윤주희', '윤지민', '윤지숙', '윤지원', '윤지혜', '윤진서', '윤하', '이경심', '이경진', '이고은', '이규정', '이금주', '이나은', '이나경', '이나연', '이나영', '이나윤', '이다인', '이다연', '이다해', '이다희', '이덕희', "이도은", '이루안', '이리안', '이미경', 
         '이미래', '이미소', '이미숙', '이미연', '이미영', '이민영', '이민정', '이민지', '이보영', '이보희', '이상숙', '이상아', '이상희', '이서연', '이선빈', '이선아', '이설', '이성경', '이세영', '이세은', '이세희', '이소연', '이소영', '이솜', '이송경', '이수경  1982년생', '이수경  1996년생', '이수나', '이수민  1984년생', '이수민  2001년생', '이수빈', '이수하', '이숙', '이슬아', '이승연', '이승주', '이시아', '이시영', '이시원', '이신애', '이아이', '이아현', '이엘', '이엘리야', '이여진', '이연두', '이연수', '이연희', '이열음', '이영아', '이영애', '이영옥', '이영유', '이영은  1982년생', 
         '이영은  2004년생', '이영진', '이예림', '이예원', '이요원', '이유담', '이유리', '이유미', '이유비', '이유선', '이유영', '이유진', '이윤미', '이윤성', '이윤지  1984년생', '이윤지  1993년생', '이은성', '이은정', '이은주', '이응경', '이의정', '이인혜', '이일화', '이자인', '이재림', '이재은  1966년생', '이재은  1980년생', '이재인', '이정빈', '이정은  1970년생', '이정은  1973년생', '이정원', '이정현', '이주빈', '이주실', '이주연', '이주영', '이주예', '이주은', '이지아', '이지원  2001년생', '이지원  2006년생', '이지은', '이지은  1999년생', 
         '이지현  1972년생', '이지현  1977년생', '이지현  1983년생', '이지현  1984년생', '이진', '이진아', '이종남', '이채영', '이채은', '이청아', '이초희', '이태란', '이하나', '이하늬', '이하얀', '이한나', '이항나', '이현경', '이현주', '이혜민', '이혜리', '이혜숙', '이혜영  1962년생', '이혜영  1971년생', '이화선', '이화영', '이휘향', '이희루', '이희진', '인아', '임성민', '임성언', '임세미', '임수정', '임수향', '임예은', '임예진', '임유빈', '임유진', '임윤아', '임은경', '임정은', '임주은', '임지연', '임지은', '임진아', '임화영','장가현', '장규리', '장나라', '장마음', '장민제', '장서연', 
         '장서희', '장성윤', '장소연', '장소정', '장신영', '장여빈', '장영남', '장영란', '장유빈', '장윤정', '장정희', '장진영', '장진희', '장하경', '장해금', '장혜지', '장혜진', '장희령', '장희진', '전계현', '전나연', '전도연', '전미도', '전미선', '전소니', '전소민', '전서진', '전수경', '전여빈', '전원주', '전익령', '전인화', '전종서', '전지현', '전혜빈', '전혜원', '전혜진  1970년생', '전혜진  1976년생', '전혜진  1988년생', '전효성', '정가은', '정구현', '정다빈  1980년생', '정다빈  2000년생', '정다은', '정다혜', '정라엘', '정려원', '정민아', '정보민', '정빈', '정선경', '정소민', '정소영', 
         '정수영', '정수정', '정시아', '정신혜', '정애란', '정애리', '정애연', '정연주', '정영숙', '정예서', '정예진', '정우연', '정유미  1983년생', '정유미  1984년생', '정유민', '정유진', '정유현', '정윤희', '정은지', '정은채', '정인선', '정일화', '정정현', '정주연', '정주원', '정지소', '정채연', '정하경', '정혜선', '정혜성', '정혜영', '정혜원', '정혜인', '조련', '조문정', '조미령  1929년생', '조미령  1973년생', '조민수', '조민아', '조보아', '조수민', '조수향', '조아람', '조아영 달샤벳', '조아영  1999년생', '조안', '조양자', '조여정', '조우리', '조유정', '조윤희', '조은숙', 
         '조이현  1991년생', '조이현  1999년생', '조혜원', '조혜정', '조혜주', '주민경', '주민하', '주새벽', '주서은', '주아름', '지세현', '지수원', '지우', '지유', '지율', '지이수', '지주연', '진경', '진기주', '진소연', '진서연', '진선혜', '진세연', '진예솔', '진지희', '진희경','차수연', '차민지', '차영주', '차예련', '차주영', '차청화', '차화연', '차희주', '채림', '채민서', '채서연', '채수빈', '채수아', '채시라', '채영인', '채원빈', '채유미', '채정안', '채지안', '천민희', '천샘', '천우희', '천희주', '천이슬', '최예원', '최강희', '최리', '최명길', '최명빈', '최성은', '최송현', '최수영', '최승윤', 
         '최아란', '최여진', '최영완', '최예빈', '최완정', '최유라', '최유진', '최유화', '최윤라', '최윤소', '최윤영', '최은숙', '최은주', '최은지', '최은희', '최자혜', '최정운', '최정원  1969년생', '최정윤', '최지나', '최지민', '최지수', '최지연  1974년생', '최지연  1975년생', '최지우', '최지혜', '최진실', '최화정', '최희서', '추소영', '추수현', '추예진', '추자현', '태미', '태현실', '표예진','하나경', '하승리', '하시은', '하연수', '하연주', '하유미', '하윤경', '하은유', '하재숙', '하지원', '하지은', '하혜라', '하희라', '한가림', '한가인', '한고은', '한다솔', '한동희', '한보람', '한보름', '한보배', 
         '한서인', '한서진  1989년생', '한서진  2008년생', '한선화', '한소은', '한소희', '한수아', '한수연', '한순례', '한아련', '한예리', '한예슬', '한유이', '한유진', '한윤희', '한은수', '한이수', '한지민', '한지성', '한지안', '한지안', '한지완', '한지우', '한지은', '한지현', '한지혜', '한재이', '한채아', '한채영', '한혜린', '한혜숙', "한혜진 가수", '한혜진', '한효주', '함은정', '해빈', '허영란', '허율', '허정은', '허정희', '현영', '홍리나', '홍세미', '홍수아', '홍수현', '홍승희', '홍아름', '홍은정', '홍은희', '홍지민', '홍지유', '홍지윤', 
         '홍진희', '홍하나임', '효민', '황가람', '황가희', '황보라', '황석정', '황선희', '황수경', '황승언', '황신혜', '황영희', '황우슬혜', '황은정', '황정민', '황정서', '황정순', '황정음', '황정인', '황채림']

class ImageCrawling():
    def __init__(self,List,sex,actor):
        self.List=List
        self.sex=sex
        self.actor=actor
        self.keyword=''
        
    def check_man(self):
        if self.sex:
            return True
        else:
            return False

    def check_actor(self):
        if self.actor:
            return True
        else:
            return False

    def Img_crow(self):
        if self.check_man():
            self.keyword+='남자'
        else:
            self.keyword+='여자'
        
        if self.check_actor():
            self.keyword+='배우'
        else:
            self.keyword+='웹툰'
         
        for search in self.List:
            downloader.download(search, limit=200,  output_dir=os.path.join(self.keyword+'사진'),
                                adult_filter_off=True, force_replace=False, timeout=70)

if __name__=="__main__":
    MEN = ImageCrawling(men,True,True)
    MEN.Img_crow()
    #WOMEN = ImageCrawling(women,False,True)
    #WOMEN.Img_crow()
    #WEBTOON = ImageCrawling(['왕자림'],False,False)
    #WEBTOON.Img_crow()